<template>
  <div>
    <h1>闭包</h1>
    <pre>
        说闭包，就得先说说作用域，作用域链

        执行期上下文： 
        当函数代码执行的前期，会创建一个执行期上下文的内部对象，AO(作用域)
        这个内部对象，是预编译的时候，创建出来的，因为当函数被调用的时候，会进行预编译
        在全局代码执行的前期，会创建出一个执行器上下文的对象GO

        函数作用域预编译过程
        1: 创建一个AO对象 AO:{}
        2: 找形参和变量声明，将形参跟变量声明当做AO对象的属性名，值为undefined
        3： 实参形参相统一
        4：在函数体内找函数声明，赋值函数体
      
      作用域链：
      AO和GO的集合
    </pre>
    <pre>
         那什么是闭包呢？

          函数存在嵌套关系内部函数可以访问外部函数的变量
         
        原因：在子函数调用之前，可以访问到上一层函数的AO,上一层函数执行完毕，被垃圾收集器销毁，
        但是由于父函数的执行上下文还被子函数引用着，所以垃圾收集器不会销毁他们所在的上下文。
    </pre>
    <pre>
        应用场景：
         保护函数内的变量安全：如迭代器、生成器。

　　      在内存中维持变量：如果缓存数据(
    
         保存this指向,手写节流防抖)、
    
         柯里化(多个参数，一次调用=> 
         调用多次，传入一个参数)
    </pre>
    <pre style="color: green; font-size: 20px">
        详细见 jsList/4.vue
    </pre>
  </div>
</template>

<scrip>
export default {};
</scrip>

<style >
</style>